justinmreina/STM32_ADCRef/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2019 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

typedef struct adcChannelConfig {
	uint32_t 	  channel;
	GPIO_TypeDef *port;
	uint16_t      pin;														/* e.g. "1" for "PA1"									*/
	uint32_t      gpio_pin;													/* e.g. "1<<1" for "PA1"								*/

} AdcChannelConfig;

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

extern AdcChannelConfig adc_getChannelConfig(uint32_t channel);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define B1_Pin 					(GPIO_PIN_13)
#define B1_GPIO_Port 			(GPIOC)
#define USART_TX_Pin 			(GPIO_PIN_2)
#define USART_TX_GPIO_Port 		(GPIOA)
#define USART_RX_Pin 			(GPIO_PIN_3)
#define USART_RX_GPIO_Port 		(GPIOA)
#define LD2_Pin 				(GPIO_PIN_5)
#define LD2_GPIO_Port 			(GPIOA)
#define TMS_Pin 				(GPIO_PIN_13)
#define TMS_GPIO_Port 			(GPIOA)
#define TCK_Pin 				(GPIO_PIN_14)
#define TCK_GPIO_Port 			(GPIOA)
#define ADC_NUM_CHANNELS		(13)

/* USER CODE BEGIN Private defines */

#define VCC_VOLTS 				(3.30)
#define ADC_RANGE				(4095)										/* 12-bit ADC resolution								*/
#define ADC_POLL_TIMEOUT_MS		(1000)

#define _nop()					asm(" nop");

/* USER CODE END Private defines */

/* Exported variables ---------------------------------------------*/
extern ADC_HandleTypeDef hadc;

extern uint32_t adc_channels[ADC_NUM_CHANNELS];


#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
